/*
1. Задать температуру в градусах по Цельсию. Вывести в alert соответствующую температуру в градусах по Фаренгейту. Подсказка: расчет идет по формуле Tf = (9 / 5) * Tc + 32, где Tf — температура по Фаренгейту, Tc — по Цельсию.
*/
let сelsius = 30;
alert((9 / 5) * сelsius + 32);
/*
2. Объявить две переменные: admin и name. Записать в name строку "Василий"; Скопировать значение из name в admin. Вывести admin (должно вывестись «Василий»).
*/
let admin
let name = "Василий";
admin = name;
console.log(admin);
/*
3. * Чему будет равно JS-выражение 1000 + "108"?
*/
let illSum = 1000 + "108";
console.log('Выражение 1000 + "108" = ' + illSum);
/*
4. * Самостоятельно разобраться с атрибутами тега script (async и defer).
defer - откладывает выполнение скрипта, пока вся страница не будет загружена полностью.
async - выполняется сражу после объявления
*/
